Ramp/unsteady/train/Allrun.sh
#!/bin/bash

. ./preProcessing.sh
ibrun -np 4 python runScript.py

